## Hands-on Lab: Using Views

### Database Used in this Lab

The database used in this lab is an internal database. You will be working on a sample HR database. This HR database schema consists of 5 tables called EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS and LOCATIONS. Each table has a few rows of sample data. The following diagram shows the tables for the HR database:

## Exercise 1: Create a View

In this exercise, you will create a View and show a selection of data for a given table.

Let’s create a view called `EMPSALARY` to display salary along with some basic sensitive data of employees from the HR database. To create the `EMPSALARY` view from the EMPLOYEES table, copy the code below and paste it to the textbox of the Run SQL page. Click `Run all`.

In [ ]:
CREATE VIEW EMPSALARY AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;

Using `SELECT`, query the `EMPSALARY` view to retrieve all the records. Copy the code below and paste it to the textbox of the Run SQL page. Click Run all.

In [ ]:
SELECT * FROM EMPSALARY;

### Exercise 2: Update a View
In this exercise, you will update a View to combine two or more tables in meaningful ways.

It now seems that the `EMPSALARY` view we created in exercise 1 doesn’t contain enough salary information, such as max/min salary and the job title of the employees. Let’s update the `EMPSALARY` view:

combining two tables `EMPLOYEES` and `JOBS` so that we can display our desired information from the HR database.
including the columns `JOB_TITLE`, `MIN_SALARY`, `MAX_SALARY` of the `JOBS` table as well as excluding the `SALARY` column of the `EMPLOYEES` table.
Copy the code below and paste it to the textbox of the Run SQL page. Click `Run all`.

In [ ]:
CREATE OR REPLACE VIEW EMPSALARY  AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE, MIN_SALARY, MAX_SALARY
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;

Using `SELECT`, query the updated `EMPSALARY` view to retrieve all the records. Copy the code below and paste it to the textbox of the Run `SQL` page. Click `Run all`.

In [ ]:
SELECT * FROM EMPSALARY;

### Exercise 3: Drop a View

In this exercise, you will drop a created View.

Let’s delete the created `EMPSALARY` view. Copy the code below and paste it to the textbox of the Run `SQL` page. Click `Run all`.

In [ ]:
DROP VIEW EMPSALARY;

## **Hands-on Lab: Stored Procedures**

### Data Used in this Lab

The data used in this lab is internal data. You will be working on the `PETSALE` table.

### Exercise 1

In this exercise, you will create and execute a stored procedure to read data from a table on Db2 using SQL.

Make sure you have created and populated the `PETSALE` table following the steps in the “`Data Used in this Lab`” section of this lab.

You will create a stored procedure routine named `RETRIEVE_ALL`.

This `RETRIEVE_ALL` routine will contain an SQL query to retrieve all the records from the `PETSALE` table, so you don’t need to write the same query over and over again. You just call the stored procedure routine to execute the query everytime.

To create the stored procedure routine, copy the code below and paste it to the textbox of the Run SQL page. Click `Run all`.

## Stored Procedures in IBM Db2 using SQL

In [ ]:
   --#SET TERMINATOR @
    CREATE PROCEDURE RETRIEVE_ALL       -- Name of this stored procedure routine
    LANGUAGE SQL                        -- Language used in this routine 
    READS SQL DATA                      -- This routine will only read data from the table
    DYNAMIC RESULT SETS 1               -- Maximum possible number of result-sets to be returned to the caller query
    BEGIN 
        DECLARE C1 CURSOR               -- CURSOR C1 will handle the result-set by retrieving records row by row from the table
        WITH RETURN FOR                 -- This routine will return retrieved records as a result-set to the caller query
        
        SELECT * FROM PETSALE;          -- Query to retrieve all the records from the table
        
        OPEN C1;                        -- Keeping the CURSOR C1 open so that result-set can be returned to the caller query
    END
    @                                   -- Routine termination character
Copied!

In [ ]:
--SET TERMINATOR @
    CREATE PROCEDURE UPDATE_LEADERS_SCORE (
     IN IN_SCHOOL_ID INTEGER, IN IN_LEADER_SCORE INTEGER)
      LANGUAGE SQL 
      MODIFIES SQL DATA
      BEGIN
      
     IF IN_SCHOOL_ID = SCHOOL_ID THEN UPDATE CHICAGO_PUBLIC_SCHOOLS 
     SET LEADER_SCORE = IN_LEADER_SCORE WHERE SCHOOL_ID = IN_SCHOOL_ID;
     
     END 
     @

To call the RETRIEVE_ALL routine, copy the code below in a `new blank script` and paste it to the textbox of the `Run SQL page`. Click `Run all`. You will have all the records retrieved from the PETSALE table.

You can view the created stored procedure routine `RETRIEVE_ALL`. Click on the 3-bar menu icon in the top left corner and click `EXPLORE` > `APPLICATION OBJECTS` > `Stored Procedures`. Find the procedure routine `RETRIEVE_ALL` from Procedures by clicking Select All. Click on the procedure routine `RETRIEVE_ALL`.

If you wish to drop the stored procedure routine `RETRIEVE_ALL`, copy the code below and paste it to the textbox of the `Run SQL` page. Click `Run all`.

In [ ]:
DROP PROCEDURE RETRIEVE_ALL;

CALL RETRIEVE_ALL;

## Stored Procedures in MySQL using phpMyAdmin

In [ ]:
 DELIMITER //
CREATE PROCEDURE RETRIEVE_ALL()

BEGIN

SELECT * FROM PETSALE;

END //

DELIMITER ;

### Exercise 2

In this exercise, you will create and execute a stored procedure to write/modify data in a table on Db2 using SQL.

Make sure you have created and populated the `PETSALE` table following the steps in the “`Data Used in this Lab`” section of this lab.

You will create a stored procedure routine named `UPDATE_SALEPRICE` with parameters `Animal_ID` and `Animal_Health`.

* This `UPDATE_SALEPRICE` routine will contain SQL queries to update the sale price of the animals in the `PETSALE` table depending on their health conditions, `BAD` or `WORSE`.
* This procedure routine will take animal ID and health conditon as parameters which will be used to update the sale price of animal in the `PETSALE` table by an amount depending on their health condition. Suppose -
* For animal with ID XX having `BAD` health condition, the sale price will be reduced further by 25%.
* For animal with ID YY having `WORSE` health condition, the sale price will be reduced further by 50%.
* For animal with ID ZZ having other health condition, the sale price won’t change.

* To create the stored procedure routine, copy the code below and paste it to the textbox of the `Run SQL` page. Click `Run all`.

In [ ]:
--#SET TERMINATOR @
    CREATE PROCEDURE UPDATE_SALEPRICE ( 
        IN Animal_ID INTEGER, IN Animal_Health VARCHAR(5) )     -- ( { IN/OUT type } { parameter-name } { data-type }, ... )
    LANGUAGE SQL                                                -- Language used in this routine
    MODIFIES SQL DATA                                           -- This routine will only write/modify data in the table
    BEGIN 
        IF Animal_Health = 'BAD' THEN                           -- Start of conditional statement
            UPDATE PETSALE
            SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.25)
            WHERE ID = Animal_ID;
        
        ELSEIF Animal_Health = 'WORSE' THEN
            UPDATE PETSALE
            SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.5)
            WHERE ID = Animal_ID;
            
        ELSE
            UPDATE PETSALE
            SET SALEPRICE = SALEPRICE
            WHERE ID = Animal_ID;
        END IF;                                                 -- End of conditional statement
        
    END
    @                                                           -- Routine termination character

Let’s call the UPDATE_SALEPRICE routine. We want to update the sale price of animal with ID `1` having `BAD` health condition in the PETSALE table. Copy the code below in a `new blank script` and paste it to the textbox of the Run SQL page. 

Click `Run all`. You will have all the records retrieved from the `PETSALE` table.

In [ ]:
CALL RETRIEVE_ALL;
CALL UPDATE_SALEPRICE(1, 'BAD');        -- Caller query
CALL RETRIEVE_ALL;

Let’s call the `UPDATE_SALEPRICE` routine once again. We want to update the sale price of animal with ID `3` having `WORSE` health condition in the PETSALE table. 

Copy the code below and paste it to the textbox of the Run SQL page. Click `Run all`. You will have all the records retrieved from the `PETSALE` table.

In [ ]:
CALL RETRIEVE_ALL;
CALL UPDATE_SALEPRICE(3, 'WORSE');      -- Caller query
CALL RETRIEVE_ALL;

You can view the created stored procedure routine `RETRIEVE_ALL`. Click on the 3-bar menu icon in the top left corner and click `EXPLORE` > `APPLICATION OBJECTS` > `Stored Procedures`. Find the procedure routine `RETRIEVE_ALL` from Procedures by clicking Select All. Click on the procedure routine `RETRIEVE_ALL`.

If you wish to drop the stored procedure routine `RETRIEVE_ALL`, copy the code below and paste it to the textbox of the `Run SQL` page. Click `Run all`.

In [ ]:
DROP PROCEDURE UPDATE_SALEPRICE;

## Summary & Highlights

Congratulations! You have completed this lesson. At this point in the course, you know:

Views are a dynamic mechanism for presenting data from one or more tables.

* A transaction represents a complete unit of work, which can be one or more SQL statements.

* An ACID transaction is one where all the SQL statements must complete successfully, or none at all.

* A stored procedure is a set of SQL statements that are stored and executed on the database server, allowing you to send one statement as an alternative to sending multiple statements.

* You can write stored procedures in many different languages like SQL PL, PL/SQL, Java, and C.

## Hands-on Lab: Joins

#### How does a CROSS JOIN (also known as Cartesian Join) statement syntax look?

In [ ]:
SELECT column_name(s)
FROM table1
CROSS JOIN table2;

#### How does an INNER JOIN statement syntax look?

In [ ]:
SELECT column_name(s)
FROM table1
INNER JOIN table2
ON table1.column_name = table2.column_name;
WHERE condition;

#### How does a LEFT OUTER JOIN statement syntax look?

In [ ]:
SELECT column_name(s)
FROM table1
LEFT OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;

#### How does a RIGHT OUTER JOIN statement syntax look?

In [ ]:
SELECT column_name(s)
FROM table1
RIGHT OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;

#### How does a FULL OUTER JOIN statement syntax look?

In [ ]:
SELECT column_name(s)
FROM table1
FULL OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;

#### How does a SELF JOIN statement syntax look?

In [ ]:
SELECT column_name(s)
FROM table1 T1, table1 T2
WHERE condition;

In [ ]:
SELECT E.F_NAME, E.L_NAME, J.START_DATE 
FROM EMPLOYEES E,
INNER JOIN JOB_HISTORY J 
ON E.EMP_ID = J.EMPL_ID
WHERE E.DEP_ID = '5';

### Exercise

Problem:

1. Select the names and job start dates of all employees who work for the department number 5.

In [ ]:
SELECT E.F_NAME,E.L_NAME, JH.START_DATE 
FROM EMPLOYEES AS E 
INNER JOIN JOB_HISTORY AS JH on E.EMP_ID=JH.EMPL_ID 
where E.DEP_ID ='5';

Problem:

2. Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [ ]:
SELECT E.F_NAME, E.L_NAME, JH.START_DATE, J.JOB_TITLE
FROM EMPLOYEES AS E
INNER JOIN JOB_HISTORY AS JH ON E.EMP_ID = JH.EMPL_ID
INNER JOIN JOBS AS J ON E.JOB_ID = J.JOB_IDENT
WHERE E.DEP_ID = '5';

Problem:

4. Re-write the previous query but limit the result set to include only the rows for employees born before 1980.

In [ ]:
SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME 
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON D.DEPT_ID_DEP = E.DEP_ID
WHERE YEAR(E.B_DATE) < '1980';

Problem:

5. Re-write the previous query but have the result set include all the employees but department names for only the employees who were born before 1980.

In [ ]:
SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME 
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON D.DEPT_ID_DEP = E.DEP_ID
AND YEAR(E.B_DATE) < '1980';

Problem:

6. Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [ ]:
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME 
FROM EMPLOYEES AS E 
FULL JOIN DEPARTMENTS AS D ON D.DEPT_ID_DEP = E.DEP_ID

Problem:

7. Re-write the previous query but have the result set include all employee names but department id and department names only for male employees.

In [ ]:
SELECT E.F_NAME, E.L_NAME, E.DEP_ID, D.DEP_NAME 
FROM EMPLOYEES AS E 
FULL JOIN DEPARTMENTS AS D ON D.DEPT_ID_DEP = E.DEP_ID
AND SEX = 'M';

### Summary & Highlights

Congratulations! You have completed this lesson. At this point in the course, you know:

- A join combines the rows from two or more tables based on a relationship between certain columns in these tables.

- To combine data from three or more different tables, you simply add new joins to the SQL statement. 

- There are two types of table joins: inner join and outer join; and three types of outer joins: left outer join, right outer join, and full outer join. 

- The most common type of join is the inner join, which matches the results from two tables and returns only the rows that match.

- You can use an alias as shorthand for a table or column name.

- You can use a self-join to compare rows within the same table

### Quiz and Assignment for Advanced SQL

#### Problem 1

List the `case number`, `type of crime` and `community area` for all crimes in community area number 18.

In [ ]:
# Done on IBM Db2
SELECT CRD.CASE_NUMBER, CRD.PRIMARY_TYPE, CRD.COMMUNITY_AREA_NUMBER
FROM CHICAGO_CRIME_DATA AS CRD
INNER JOIN CENSUS_DATA AS CD ON CD.COMMUNITY_AREA_NUMBER = CRD.COMMUNITY_AREA_NUMBER
WHERE CRD.COMMUNITY_AREA_NUMBER = '18'

Problem 2

List `all crimes` that took place at a school. Include `case number`, `crime type` and `community name`.

In [ ]:
# The code finally ran (i had to space the words in red)
SELECT CRD.CASE_NUMBER, CRD.PRIMARY_TYPE, CRD.LOCATION_DESCRIPTION, CD.COMMUNITY_AREA_NAME
FROM CHICAGO_CRIME_DATA AS CRD
LEFT OUTER JOIN CENSUS_DATA AS CD ON CD.COMMUNITY_AREA_NUMBER = CRD.COMMUNITY_AREA_NUMBER
WHERE CRD.LOCATION_DESCRIPTION IN ('SCHOOL, PUBLIC, GROUNDS','SCHOOL, PUBLIC, BUILDING','SCHOOL, PRIVATE, BUILDING')

In [ ]:
# This is for crime happened at Grocery food store n Sidewalk

SELECT CRD.CASE_NUMBER, CRD.PRIMARY_TYPE, CRD.LOCATION_DESCRIPTION, CD.COMMUNITY_AREA_NAME
FROM CHICAGO_CRIME_DATA AS CRD
LEFT OUTER JOIN CENSUS_DATA AS CD ON CD.COMMUNITY_AREA_NUMBER = CRD.COMMUNITY_AREA_NUMBER
WHERE CRD.LOCATION_DESCRIPTION IN ('GROCERY FOOD STORE','SIDEWALK')

Problem 3

For the communities of `Oakland`, `Armour Square`, `Edgewater` and `CHICAGO` list the associated community_area_numbers and the case_numbers.

In [ ]:
SELECT CRD.COMMUNITY_AREA_NUMBER, CRD.CASE_NUMBER, CD.COMMUNITY_AREA_NAME
FROM CHICAGO_CRIME_DATA AS CRD 
FULL JOIN CENSUS_DATA AS CD ON CD.COMMUNITY_AREA_NUMBER = CRD.COMMUNITY_AREA_NUMBER 
WHERE CD.COMMUNITY_AREA_NAME IN ('OAKLAND','ARMOUR SQUARE','EDGEWATER','CHICAGO')

# Returned value for only CHICAGO

### Exercise 1: Using Joins

You have been asked to produce some reports about the communities and crimes in the Chicago area. You will need to use SQL join queries to access the data stored across multiple tables.

Question 1

Write and execute a SQL query to list the `school names`, `community names` and `average attendance` for communities with a `hardship index` of 98.

In [ ]:
SELECT CPS.NAME_OF_SCHOOL, CPS.COMMUNITY_AREA_NAME, CPS.AVERAGE_STUDENT_ATTENDANCE, CD.HARDSHIP_INDEX 
FROM CHICAGO_PUBLIC_SCHOOLS AS CPS
LEFT OUTER JOIN CENSUS_DATA AS CD ON CD.COMMUNITY_AREA_NUMBER = CPS.COMMUNITY_AREA_NUMBER
WHERE CD.HARDSHIP_INDEX = 98

Question 2

Write and execute a SQL query to list all crimes that took place at a `school`. Include `case number`, `crime type` and `community name`.

In [ ]:
SELECT CRD.CASE_NUMBER, CRD.PRIMARY_TYPE, CRD.LOCATION_DESCRIPTION, CD.COMMUNITY_AREA_NAME
FROM CHICAGO_CRIME_DATA AS CRD
LEFT OUTER JOIN CENSUS_DATA AS CD ON CD.COMMUNITY_AREA_NUMBER = CRD.COMMUNITY_AREA_NUMBER
WHERE CRD.LOCATION_DESCRIPTION IN ('SCHOOL, PUBLIC, GROUNDS','SCHOOL, PUBLIC, BUILDING','SCHOOL, PRIVATE, BUILDING')

### Exercise 2: Creating a View

For privacy reasons, you have been asked to create a view that enables users to select just the school name and the icon fields from the CHICAGO_PUBLIC_SCHOOLS table. By providing a view, you can ensure that users cannot see the actual scores given to a school, just the icon associated with their score. You should define new names for the view columns to obscure the use of scores and icons in the original table.

Question 1

Write and execute a SQL statement to create a `view` showing the columns listed in the following table, with `new column names` as shown in `the second column`.

In [ ]:
CREATE OR REPLACE VIEW NEW_COLUMN_NAME AS
SELECT NAME_OF_SCHOOL AS SCHOOL_NAME, SAFETY_ICON AS SAFETY_RATING, 
FAMILY_INVOLVEMENT_ICON AS FAMILY_RATING, 
ENVIRONMENT_ICON AS ENVIRONMENT_RATING, INSTRUCTION_ICON AS INSTRUCTION_RATING,
LEADERS_ICON AS LEADERS_RATING, TEACHERS_ICON AS TEACHERS_RATING
FROM CHICAGO_PUBLIC_SCHOOLS

- Write and execute a SQL statement that returns all of the columns from the view.

- Write and execute a SQL statement that returns just the school name and leaders rating from the view.

In [ ]:
CREATE OR REPLACE VIEW NEW_COLUMN_NAME AS
SELECT NAME_OF_SCHOOL AS SCHOOL_NAME, SAFETY_ICON AS SAFETY_RATING, 
FAMILY_INVOLVEMENT_ICON AS FAMILY_RATING, 
ENVIRONMENT_ICON AS ENVIRONMENT_RATING, INSTRUCTION_ICON AS INSTRUCTION_RATING,
LEADERS_ICON AS LEADERS_RATING, TEACHERS_ICON AS TEACHERS_RATING
FROM CHICAGO_PUBLIC_SCHOOLS;

SELECT * FROM NEW_COLUMN_NAME;

In [ ]:
SELECT SCHOOL_NAME, LEADERS_RATING
FROM NEW_COLUMN_NAME;

### Exercise 3: Creating a Stored Procedure

The icon fields are calculated based on the value in the corresponding score field. You need to make sure that when a score field is updated, the icon field is updated too. To do this, you will write a stored procedure that receives the school id and a leaders score as input parameters, calculates the icon setting and updates the fields appropriately.

#### Question 1

Write the structure of a query to create or replace a stored procedure called `UPDATE_LEADERS_SCORE` that takes a `in_School_ID` parameter as an integer and a `in_Leader_Score` parameter as an integer. Don’t forget to use the #SET TERMINATOR statement to use the @ for the CREATE statement terminator.

In [ ]:
--#SET TERMINATOR @
CREATE PROCEDURE UPDATE_LEADERS_SCORE (
IN IN_SCHOOL_ID INTEGER, IN IN_LEADER_SCORE INTEGER)
LANGUAGE SQL 
MODIFIES SQL DATA
BEGIN

END
@

#### Question 2

Inside your stored procedure, write a SQL statement to update the `Leaders_Score` field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by `in_School_ID` to the value in the `in_Leader_Score` parameter.

In [ ]:
--#SET TERMINATOR @
CREATE PROCEDURE UPDATE_LEADERS_SCORE (
IN IN_SCHOOL_ID INTEGER, IN IN_LEADER_SCORE INTEGER)
LANGUAGE SQL 
MODIFIES SQL DATA
BEGIN

      UPDATE CHICAGO_PUBLIC_SCHOOLS
      SET "LEADERS_SCORE" = IN_LEADER_SCORE WHERE "SCHOOL_ID" = IN_SCHOOL_ID;
 
END
@

In [ ]:
#### Question 3

Inside your stored procedure, write a SQL IF statement to update the Leaders_Icon field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID using the following information.

Scorelower limit	Score upper limit	Icon
   80	               99	            Very strong
   60	               79	             Strong
   40	               59	             Average
   20	               39	             Weak
    0	               19	             Very weak

In [ ]:
CALL PROCESS_ALL;
CALL UPDATE_LEADERS_ICONS(609927, 50);
CALL PROCESS_ALL;

#### Question 4, 5 n 6 (Answers below)

- Inside your stored procedure, write a SQL IF statement to update the Leaders_Icon field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID using the following information. 

- Update your stored procedure definition. Add a generic ELSE clause to the IF statement that rolls back the current work if the score did not fit any of the preceding categories. 

- Update your stored procedure definition again. Add a statement to commit the current unit of work at the end of the procedure.

In [ ]:
--#SET TERMINATOR @
CREATE PROCEDURE UPDATE_LEADERS_ICONS (
IN IN_SCHOOL_ID INTEGER, IN IN_LEADER_SCORE INTEGER)
LANGUAGE SQL 
MODIFIES SQL DATA
BEGIN

UPDATE CHICAGO_PUBLIC_SCHOOLS
SET "LEADERS_SCORE" = IN_LEADER_SCORE WHERE "SCHOOL_ID" = IN_SCHOOL_ID;

      IF IN_LEADER_SCORE > 0 AND IN_LEADER_SCORE < 20 THEN UPDATE CHICAGO_PUBLIC_SCHOOLS 
      SET "LEADERS_ICON" = 'VERY WEAK';
      
      ELSEIF IN_LEADER_SCORE < 40 THEN UPDATE CHICAGO_PUBLIC_SCHOOLS 
      SET "LEADERS_ICON" = 'WEAK'; 
      
      ELSEIF IN_LEADER_SCORE < 60 THEN UPDATE CHICAGO_PUBLIC_SCHOOLS 
      SET "LEADERS_ICON" = 'AVERAGE';
      
      ELSEIF IN_LEADER_SCORE < 80 THEN UPDATE CHICAGO_PUBLIC_SCHOOLS 
      SET "LEADERS_ICON" = 'STRONG';
      
      ELSEIF IN_LEADER_SCORE < 100 THEN UPDATE CHICAGO_PUBLIC_SCHOOLS 
      SET "LEADERS_ICON" = 'VERY STRONG';

      ELSE
      ROLLBACK;

END IF;
 
    UPDATE CHICAGO_PUBLIC_SCHOOLS
    SET "LEADERS_SCORE" = IN_LEADER_SCORE WHERE "SCHOOL_ID" = IN_SCHOOL_ID;
    
    COMMIT;
    
END
@